export const orders = [
  {
    id: "#BK5625",
    date: "۱۰ اردیبهشت ۱۴۰۳",
    product: "کتاب شازده کوچولو",
    customerName: "آنا محمدی",
    phone: "۰۹۱۵۱۲۳۴۵۶۷",
    address: "تهران، خیابان ولیعصر",
    paymentType: "کارت بانکی",
    status: "تکمیل شده",
  },
  {
    id: "#BK9652",
    date: "۶ اردیبهشت ۱۴۰۳",
    product: "کتاب ملت عشق",
    customerName: "جودیت فراهانی",
    phone: "۰۹۳۵۶۷۸۹۰۱۲",
    address: "اصفهان، میدان نقش جهان",
    paymentType: "کارت بانکی",
    status: "تکمیل شده",
  },
  {
    id: "#BK5984",
    date: "۶ اردیبهشت ۱۴۰۳",
    product: "کتاب سمفونی مردگان",
    customerName: "پیتر احمدی",
    phone: "۰۹۱۳۴۵۶۷۸۹۰",
    address: "مشهد، بلوار سجاد",
    paymentType: "پرداخت در محل",
    status: "تکمیل شده",
  },
  {
    id: "#BK3625",
    date: "۲ اردیبهشت ۱۴۰۳",
    product: "کتاب سووشون",
    customerName: "امانوئل رضایی",
    phone: "۰۹۰۱۲۳۴۵۶۷۸",
    address: "شیراز، خیابان کریم‌خان زند",
    paymentType: "پرداخت در محل",
    status: "در حال پردازش",
  },
  {
    id: "#BK8652",
    date: "۲۹ فروردین ۱۴۰۳",
    product: "کتاب بینوایان",
    customerName: "ویلیام کوهستانی",
    phone: "۰۹۱۲۳۴۵۶۷۸۹",
    address: "تبریز، خیابان ولیعصر",
    paymentType: "کارت بانکی",
    status: "در حال پردازش",
  },
  {
    id: "#BK86bb",
    date: "۲۹ فروردین ۱۴۰۳",
    product: "کتاب بینوایان",
    customerName: "ویلیام کوهستانی",
    phone: "۰۹۱۲۳۴۵۶۷۸۹",
    address: "تبریز، خیابان ولیعصر",
    paymentType: "کارت بانکی",
    status: "درخواست بازگشت",
  },
];

export const adminOrdersOptionFilter = [
  { value: "all", label: "همه" },
  { value: "تکمیل شده", label: "تکمیل شده ها" },
  { value: "در حال پردازش", label: "در حال پردازش" },
  { value: "لغو شده", label: "لغو شده ها" },
];

export const bookListTabelHeader = [
  { key: "image", label: "تصویر" },
  { key: "title", label: "عنوان" },
  { key: "author", label: "نویسنده" },
  { key: "categories", label: "دسته‌بندی‌ها" },
  { key: "price", label: "قیمت" },
  { key: "actions", label: "عملیات" },
];

export const categoriesListTabelHeader = [
  { key: "name", label: "نام" },
  { key: "status", label: "وضعیت" },
  { key: "createdAt", label: "زمان ساخت" },
  { key: "action", label: "عملیات" },
];

export const roles = [
  {
    value: "All",
    label: "همه نقش‌ها",
    responsibilities: [],
    jobs: [], // no specific jobs
  },
  {
    value: "Admin",
    label: "ادمین",
    responsibilities: [
      "اطمینان از امنیت و صحت داده‌ها",
      "پاسخگویی به مشکلات کاربران",
      "نظارت بر عملکرد سیستم",
    ],
    jobs: [
      "مدیریت کامل سیستم (CRUD همه اطلاعات)",
      "افزودن، ویرایش و حذف کاربران",
      "تعیین نقش برای کاربران",
      "مدیریت رویدادها (ایجاد، ویرایش، حذف)",
      "دسترسی به گزارش‌ها و آمار",
      "مدیریت اعلان‌ها",
    ],
  },
  {
    value: "Editor",
    label: "ویراستار",
    responsibilities: [
      "اطمینان از کیفیت محتوای منتشرشده",
      "هماهنگی با ادمین برای تایید تغییرات مهم",
    ],
    jobs: [
      "ایجاد و ویرایش محتوای رویدادها",
      "مدیریت توضیحات، عکس‌ها و جزئیات",
      "تایید یا رد درخواست‌های تغییر محتوا",
      "مشاهده اطلاعات کاربران مرتبط با رویداد",
    ],
  },
  {
    value: "User",
    label: "کاربر",
    responsibilities: [
      "ارائه اطلاعات دقیق در فرم ثبت‌نام",
      "رعایت قوانین و شرایط سیستم",
    ],
    jobs: [
      "ثبت‌نام در سیستم",
      "مشاهده رویدادها",
      "ثبت‌نام در رویداد مورد نظر",
      "دریافت اعلان‌ها",
      "مشاهده نتیجه ارزیابی‌ها",
    ],
  },
  {
    value: "Viewer",
    label: "مهمان",
    responsibilities: [
      "فقط نقش مشاهده‌کننده دارد، بدون امکان تغییر یا ثبت‌نام",
    ],
    jobs: ["مشاهده عمومی رویدادها (بدون ثبت‌نام)", "مرور اطلاعات محدود"],
  },
];

export const permissionsOptions = [
  { value: "مدیریت کاربران", label: "مدیریت کاربران" },
  { value: "تعیین نقش‌ها و سطح دسترسی", label: "تعیین نقش‌ها و سطح دسترسی" },
  { value: "بازبینی و تأیید محتوا", label: "بازبینی و تأیید محتوا" },
  { value: "تحلیل و بررسی گزارش‌ها", label: "تحلیل و بررسی گزارش‌ها" },
  { value: "نظارت بر عملکرد سیستم", label: "نظارت بر عملکرد سیستم" },
  { value: "کنترل و رعایت مسائل امنیتی", label: "کنترل و رعایت مسائل امنیتی" },
  { value: "هماهنگی بین اعضای تیم", label: "هماهنگی بین اعضای تیم" },
  { value: "واگذاری وظایف به دیگران", label: "واگذاری وظایف به دیگران" },
  { value: "پیگیری موجودی و منابع", label: "پیگیری موجودی و منابع" },
  { value: "مشاهده محتوا", label: "مشاهده محتوا " },
  {
    value: "پشتیبانی و پاسخ‌گویی به کاربران",
    label: "پشتیبانی و پاسخ‌گویی به کاربران",
  },
];
